/******************************************************************
** 文件名:	TraceChat.h
** 版  权:	(C)  
** 
** 日  期:	2008-3-21
** 版  本:	1.0
** 描  述:	Trace to chat window			
** 应  用:  
******************************************************************/
#pragma  once

class TraceChat : public xs::TraceListener
{
public:
	/************************************************************************/
	/* constructor and deconstructor                                        */
	/************************************************************************/
	TraceChat();
	~TraceChat();

public:
	/************************************************************************/
	/* interface functions                                                   */
	/************************************************************************/
	virtual void onTrace(const char* msg, const char* time, TraceLevel level);
};
